Revit 2024 API
UnitTypeId.MeganewtonsPerMeter Property
 Meganewtons per meter.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2021
Syntax
C#
public static ForgeTypeId MeganewtonsPerMeter { get; }
Visual Basic
Public Shared ReadOnly Property MeganewtonsPerMeter As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ MeganewtonsPerMeter {
	ForgeTypeId^ get ();
}
See Also
UnitTypeId Class
Autodesk.Revit.DB Namespace